/**********************************************************
				用于AD温度线性拟合
**********************************************************/
#include <stdio.h>

#define N 10	//折线由10个线段组成，即有11个点
float w=10.0;	//插值节点间隔为10℃
float w0=0.0;	//起始温度
float wn=100.0;	//终点温度

//11个节点A/D转换结果
int adc[N+1] = {86,376,687,1021,1379,1760,2164,2592,3043,3515,4008};
	
float line(int x)
{
	int i;
	if(x<adc[0]) return (w0);	//如果AD转换结果过低，返回起始温度
	if(x>=adc[N]) return (wn);	//如果AD转换结果过高，返回终点温度
	for(i=0;i<N;i++)	
		if(x<adc[i+1])	break;	//判断x的所在区间，得到i的坐标
		return (w*i+w*(x-adc[i])/(adc[i+1]-adc[i]));	//利用点斜式线性插值法计算温度值

}

int main()		//折线插值法验算程序
{
	int x;
	float y;
	while(1)
	{
		printf("\nAD转化结果：");
		scanf("%d",&x);
		if(x==0)break;
		y=line(x);	//执行折线插值法算法
		printf("\n对应温度为： %2.2f℃",y);
	}
}